---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurtainWallPanelHostId
source: html/24762409-8284-9481-2d0a-798159186015.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurtainWallPanelHostId Property

"Host Id"

## Syntax (C#)
```csharp
public static ForgeTypeId CurtainWallPanelHostId { get; }
```